Конфигурация/Documents/ВводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВводДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваПереданныеВОплатуПаев</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаличные</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пай</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетЕПС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДоговорТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ВводыВыводыАктивовВВалютеУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВводыВыводыАктивовВВалютеУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииВводаВыводаДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДенежныеСредстваНаличные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваНаличные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ФормыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ВводДенежныхСредств/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	// остатки ценных бумаг
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ВводыВыводыАктивовВВалютеУчета");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация", ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("НаправлениеДвижения", Перечисления.ВидыДвижений.Приход);
	ЭлементБлокировкиДанных.УстановитьЗначение("ВидАктива", Перечисления.ВидыАктивов.ДенежныеСредства);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Основание) И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") И Не ЭтотОбъект.Основание.ВыводВсехАктивов Тогда
		
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям");
		
		ЭлементБлокировкиДанных.УстановитьЗначение("Организация", ЭтотОбъект.Организация);
		ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		ЭлементБлокировкиДанных.УстановитьЗначение("ТипЗадолженности", Перечисления.ТипыЗадолженности.Дебиторская);
		ЭлементБлокировкиДанных.УстановитьЗначение("Основание", ЭтотОбъект.Основание);
		
	КонецЕсли;
		
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();

	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ОстаткиДенежныхСредств.Записывать                       = Истина;
	Движения.ДенежныеСредстваНаличные.Записывать                     = Истина;
	Движения.ВводыВыводыАктивовВВалютеУчета.Записывать               = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать             = Истина;
	Движения.ДенежныеСредстваПереданныеВОплатуПаев.Записывать        = Истина;
	Движения.ЗадолженностиПоДенежнымСредствамПоПоручениям.Записывать = Истина;

	// остатки д/с
	Если ЭтотОбъект.РасчетныйСчет.ТранзитныйПИФ Тогда
		
		// Реестр денежных средств переданных в оплату паев
		Если ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
			
			Движение = Движения.ДенежныеСредстваПереданныеВОплатуПаев.ДобавитьПриход();
			
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Пайщик                       = ЭтотОбъект.Основание.Пайщик;
			Движение.РасчетныйСчет                = ЭтотОбъект.РасчетныйСчет;
			Движение.Сумма                        = ЭтотОбъект.Сумма;
			
		ИначеЕсли ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОшибочноЗачисленные Тогда
			
			Движение = Движения.ДенежныеСредстваПереданныеВОплатуПаев.ДобавитьПриход();
			
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Пайщик                       = Неопределено;
			Движение.РасчетныйСчет                = ЭтотОбъект.РасчетныйСчет;
			Движение.Сумма                        = ЭтотОбъект.Сумма;
			
		КонецЕсли;
		
	Иначе
		
		Если ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная Тогда
			Движение = Движения.ОстаткиДенежныхСредств.ДобавитьПриход();
			
			Движение.Период      				    = ЭтотОбъект.Дата;
			Движение.Организация 				    = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления   = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Брокер                         = ЭтотОбъект.Брокер;
			Движение.МестоХранения                  = Справочники.МестаХранения.ВнебиржевойРынок;
			Движение.РасчетныйСчет				    = ЭтотОбъект.РасчетныйСчет;
			Движение.Валюта						    = ЭтотОбъект.Валюта;
			Движение.Сумма						    = ЭтотОбъект.Сумма;
			Движение.ВидДвиженияДенежныхСредств     = Перечисления.ВидыДвиженийДенежныхСредств.ВводДенежныхСредств;
			Движение.ВариантДвиженияДенежныхСредств = ЭтотОбъект.ВидОперации;
			
		Иначе
			Движение = Движения.ДенежныеСредстваНаличные.ДобавитьПриход();
			
			Движение.Период      				  = ЭтотОбъект.Дата;
			Движение.Организация 				  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.Касса                        = ЭтотОбъект.Касса;
			Движение.Сумма						  = ЭтотОбъект.Сумма;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Основание) Тогда
			
			Если ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
				
				//Задолженность перед пайщиком
				Если ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВводДенежныхСредствПриОбменеПаев Тогда
					Движение					= Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход();
					Движение.ТипЗадолженности	= Перечисления.ТипыЗадолженности.Дебиторская;
					Движение.Аванс = Ложь;
				Иначе
					Движение					= Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
					Движение.ТипЗадолженности	= Перечисления.ТипыЗадолженности.Кредиторская;
					Движение.Аванс				= (ЭтотОбъект.Основание.ВидЗаявки <> Перечисления.ВидыЗаявокПайщиков.Погашение);
				КонецЕсли;					
					
				Движение.Период							= ЭтотОбъект.Дата;
				Движение.Основание						= ЭтотОбъект.Основание;
				Движение.Организация					= ЭтотОбъект.Организация;
				Движение.СчетДоверительногоУправления	= ЭтотОбъект.СчетДоверительногоУправления;				
				Движение.ВидЗадолженности				= Справочники.ВидыЗадолженности.ПередПайщиками;
				Движение.Контрагент						= ЭтотОбъект.Основание.Пайщик;
				Движение.Валюта							= ЭтотОбъект.Валюта;
				Движение.Сумма							= ЭтотОбъект.Сумма;				
				
			ИначеЕсли ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") И Не ЭтотОбъект.Основание.ВыводВсехАктивов Тогда
				//Задолженность по поручениям	
				Движение = Движения.ЗадолженностиПоДенежнымСредствамПоПоручениям.ДобавитьРасход();
				
				Движение.Период                       = ЭтотОбъект.Дата;
				Движение.Организация                  = ЭтотОбъект.Организация;
				Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
				Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
				Движение.Валюта                       = ЭтотОбъект.Валюта;
				Движение.Основание                    = ЭтотОбъект.Основание;
				Движение.Сумма                        = ЭтотОбъект.Сумма;

			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// вводы/выводы активов
	СуммаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуДокументаВВалютеУчета(
		ЭтотОбъект.Сумма, ЭтотОбъект.Валюта, ЭтотОбъект, Отказ);
	
	Движение = Движения.ВводыВыводыАктивовВВалютеУчета.Добавить();
	
	Движение.НаправлениеДвижения		  = Перечисления.ВидыДвижений.Приход;
	Движение.ВидОперацииВводаВыводаДС	  = ЭтотОбъект.ВидОперации;
	Движение.Период						  = ЭтотОбъект.Дата;
	Движение.Организация				  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.ВидАктива					  = Перечисления.ВидыАктивов.ДенежныеСредства;   
	Движение.БалансоваяСтоимость		  = СуммаВВалютеУчета;
	Движение.РыночнаяСтоимость			  = СуммаВВалютеУчета;
	
	Движения.Записать();
	
	// реестр платежей
	РегистрыСведений.РеестрПлатежей.ЗарегистрироватьПлатеж(ЭтотОбъект,
		РегистрыСведений.РеестрПлатежей.СкомпоноватьСведенияОСтрокеБанковскойВыписки(
			ЭтотОбъект.СтрокаБанковскойВыписки,
			Перечисления.ВидыДвижений.Приход,
			ЭтотОбъект.Сумма,
			Перечисления.ВидыДвиженийДенежныхСредств.ВводДенежныхСредств));
			
	Если ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВводыВыводыАктивовВВалютеУчетаОбороты.БалансоваяСтоимостьОборот
			|ИЗ
			|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
			|				И НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты";
		
		Запрос.УстановитьПараметр("КонецПериода", 	Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("НачалоПериода", 	НачалоГода(ЭтотОбъект.Дата));
		Запрос.УстановитьПараметр("Организация", 	ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			КонтрольнаяСумма = 1000000;			
			Если ВыборкаДетальныеЗаписи.БалансоваяСтоимостьОборот > КонтрольнаяСумма Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма вводов денежных средств на индивидуальный инвестиционный счет превысила " + КонтрольнаяСумма + " рублей за год и составила " + ВыборкаДетальныеЗаписи.БалансоваяСтоимостьОборот + " рублей", ЭтотОбъект, "СчетДоверительногоУправления",, Отказ);
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Основание) И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда
		
		Если ЭтотОбъект.Основание.ВыводВсехАктивов Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать ввод денежных средств на основании поручения на вывод всех активов",,, "Объект.Основание", Отказ);	
		Иначе
			РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЗадолженностиПоДенежнымСведствамПоПоручениям(ЭтотОбъект, Отказ);
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВводДенежныхСредствПриОбменеПаев Тогда 
		
		РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЗадолженностиПоДенежнымСведствам(ЭтотОбъект, Отказ);
		
	КонецЕсли;
	
	// Если создан ввод ДС без основания (допустим забыли указать) тогда нужно проверить наличие задолженности по поручению.
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	Если ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами  Тогда
		
		ПриходНаБрокера = (ЭтотОбъект.РасчетныйСчет = Справочники.БанковскиеСчета.ПустаяСсылка());
		
		// 205 ли 306 / приход денег
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Приход процентов по СМО");
		
		Если ПриходНаБрокера Тогда
			
			КонтрагентДляПроводок = ЭтотОбъект.Брокер.ЮрФизЛицо;
			УсловияЗаймовКредитовИДепозитов	= БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
			ГФУ	= БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаДоходовРасходов("31120");
			
			Проводка.СчетДт = ПланыСчетов.Единый.РасчетыСБрокерами02;
			
			Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = УсловияЗаймовКредитовИДепозитов;
		
		Иначе
			
			КонтрагентДляПроводок = ЭтотОбъект.РасчетныйСчет.Банк.ЮрФизЛицо;
			УсловияЗаймовКредитовИДепозитов	= ЭтотОбъект.РасчетныйСчет.Договор;
			ГФУ = БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаДоходовРасходов("3112", Новый Структура("Банк,Период",ЭтотОбъект.РасчетныйСчет.Банк, Дата));
			
			Если Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчет.Банк,Дата) Тогда
				Проводка.СчетДт = ПланыСчетов.Единый.РасчетныеСчета01;
			Иначе
				Проводка.СчетДт = ПланыСчетов.Единый.РасчетныеСчета02;
			КонецЕсли;
			
			Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
			
		КонецЕсли;
		
		Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПриходПроцентовСМО;
		
		Проводка.ВалютаДт 		 = Валюта;
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		
		// Если используется счет 20613
		ИспользоватьСчетРасчетовПоПроцентамДляМНО = БухгалтерскийУчет.ОпределитьНастройкуУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, "ИспользоватьСчетРасчетовПоПроцентамДляМНО");
		Если ИспользоватьСчетРасчетовПоПроцентамДляМНО И НЕ ПриходНаБрокера Тогда
			//  / 20613 
			Проводка.СчетКт = ПланыСчетов.Единый.Депозиты13;
			
			Проводка.СубконтоКт.БанковскиеСчета					= ЭтотОбъект.РасчетныйСчет;
			Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов	= ЭтотОбъект.РасчетныйСчет.Договор;
			
			Проводка.ВалютаКт 		 = Валюта;
			Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
			
			// 20613 /
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Приход процентов по СМО");
			
			Проводка.СчетДт = ПланыСчетов.Единый.Депозиты13;
			
			Проводка.СубконтоДт.БанковскиеСчета					= ЭтотОбъект.РасчетныйСчет;
			Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов	= ЭтотОбъект.РасчетныйСчет.Договор;
			
			Проводка.ВалютаДт 		 = Валюта;
			Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		КонецЕсли;
		
		//  / 20603 или 20507
		Если НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.Депозиты Тогда
			
			Проводка.СчетКт = ПланыСчетов.Единый.Депозиты03;
			
			Проводка.СубконтоКт.Контрагенты						= КонтрагентДляПроводок;
			Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов	= УсловияЗаймовКредитовИДепозитов;
			
		ИначеЕсли НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.РасчетныеСчета Тогда
			
			Проводка.СчетКт = ПланыСчетов.Единый.РасчетныеСчета07;
			
			Проводка.СубконтоКт.БанковскиеСчета					= ЭтотОбъект.РасчетныйСчет;
			Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов	= УсловияЗаймовКредитовИДепозитов;
			
		КонецЕсли;
			
		Проводка.ВалютаКт 		 = Валюта;
		Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
		
		// 20603 или 20507 / 71001
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Начисление процентов по СМО");
		
		Если НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.Депозиты Тогда
			
			Проводка.СчетДт = ПланыСчетов.Единый.Депозиты03;
			
			Проводка.СубконтоДт.Контрагенты						= КонтрагентДляПроводок;
			Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов	= УсловияЗаймовКредитовИДепозитов;
			
		ИначеЕсли НастройкиУчета.СчетУчетаПроцентовПоМНО = ПланыСчетов.Единый.РасчетныеСчета Тогда
			
			Проводка.СчетДт = ПланыСчетов.Единый.РасчетныеСчета07;
			
			Проводка.СубконтоДт.БанковскиеСчета					= ЭтотОбъект.РасчетныйСчет;
			Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов	= УсловияЗаймовКредитовИДепозитов;
			
		КонецЕсли;
		
		Проводка.ВалютаДт 		 = Валюта;
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		
		Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
		
		Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов 	= ГФУ;
		Если ПриходНаБрокера Тогда
			Проводка.СубконтоКт.ЦенныеБумаги 							= УсловияЗаймовКредитовИДепозитов;	
		Иначе
			Проводка.СубконтоКт.ЦенныеБумаги 							= ЭтотОбъект.РасчетныйСчет;	
		КонецЕсли;
		
		// 71001 / 47903 
		Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
		
		Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
		
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Закрытие доначисления процентов по СМО");
			
			Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеДоходы01;
			
			Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов 	= ГФУ;
			Если ПриходНаБрокера Тогда
				Проводка.СубконтоДт.ЦенныеБумаги 							= УсловияЗаймовКредитовИДепозитов;
			Иначе
				Проводка.СубконтоДт.ЦенныеБумаги 							= ЭтотОбъект.РасчетныйСчет;
			КонецЕсли;
			
			Проводка.СчетКт = ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоКт.Договоры = ЭтотОбъект.СчетДоверительногоУправления;
			
		КонецЕсли;
		
	Иначе	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Ввод денежных средств");
		
		Если ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление Тогда
			ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ВводДенежныхСредств;
		ИначеЕсли ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратИзлишнеУдержаннойКомиссии Тогда
			ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПоступлениеДенежныхСредствОтУК;
		ИначеЕсли ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОшибочноЗачисленные Тогда
			ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ОшибочноЗачисленныеСписанныеДенежныеСредства;	
		Иначе
			ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ВводДенежныхСредствВДУ;
		КонецЕсли;
		
		Если ЭтотОбъект.Брокер = Справочники.БрокерскиеКомпании.ПустаяСсылка() Тогда
			
			Если Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчет.Банк,Дата) Тогда
				Проводка.СчетДт = ПланыСчетов.Единый.РасчетныеСчета01;
			Иначе
				Проводка.СчетДт = ПланыСчетов.Единый.РасчетныеСчета02;
			КонецЕсли;
			
			Проводка.СубконтоДт.БанковскиеСчета 			= ЭтотОбъект.РасчетныйСчет;
			Проводка.СубконтоДт.ВидДвиженияДенежныхСредств 	= ВидДвиженияДенежныхСредств;
			
		Иначе
			Проводка.СчетДт										= ПланыСчетов.Единый.РасчетыСБрокерами02;
			Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
			Проводка.СубконтоДт.ВидДвиженияДенежныхСредств 		= ВидДвиженияДенежныхСредств;
			
		КонецЕсли;
		
		Проводка.ВалютаДт  = ЭтотОбъект.Валюта;
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.КоррСчетЕПС) Тогда
		
			Проводка.СчетКт = ЭтотОбъект.КоррСчетЕПС;
			
			Для НомСубк = 1 По Проводка.СчетКт.ВидыСубконто.Количество() Цикл
				Проводка.СубконтоКт[ЭтотОбъект.КоррСчетЕПС.ВидыСубконто[НомСубк - 1].ВидСубконто] = ЭтотОбъект["СубконтоЕПС" + НомСубк];
			КонецЦикла;
		
		ИначеЕсли ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратИзлишнеУдержаннойКомиссии Тогда 
			Проводка.СчетКт 				= ПланыСчетов.Единый.АктивыВДУ02;
			Проводка.СубконтоКт.Договоры 	= СчетДоверительногоУправления;
		ИначеЕсли ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПрочиеВводы
			ИЛИ ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПриНеудачномВыводеДенежныхСредствПайщику Тогда 
			Проводка.СчетКт 				= ПланыСчетов.Единый.Расчеты22;
			Проводка.СубконтоКт.Контрагенты = Контрагент;
		ИначеЕсли ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОшибочноЗачисленные Тогда 
			Проводка.СчетКт 						= ПланыСчетов.Единый.Расчеты16;
			Проводка.СубконтоКт.Контрагенты 		= Контрагент;
			Проводка.СубконтоКт.ОснованиеРасчетов 	= ЭтотОбъект.Ссылка;	
		Иначе	
			//дописать основание расчетов
			Проводка.СчетКт 				= ПланыСчетов.Единый.АктивыВДУ03;
			Проводка.СубконтоКт.Договоры 	= СчетДоверительногоУправления;
		КонецЕсли;
		
		Если Проводка.СчетКт.Валютный Тогда
			Проводка.ВалютаКт  			= ЭтотОбъект.Валюта;
			Проводка.ВалютнаяСуммаКт 	= ЭтотОбъект.Сумма;
		КонецЕсли;
		
	КонецЕсли;
	БухгалтерскийУчетЕПС.ПереоценитьВалютныеАктивы(ЭтотОбъект, Отказ);
	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);	
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Если ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПайщика 
		или ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОшибочноЗачисленные
		     и ЭтотОбъект.РасчетныйСчет.ТранзитныйПИФ Тогда
		// Не ведется бухгалтерский учет	 
		Возврат;
	КонецЕсли;

	
	СуммаВВалютеУчета = РаботаСВалютами.ПолучитьСуммуДокументаВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.Валюта, ЭтотОбъект, Отказ);
	
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаВВалютеУчета, "Ввод денежных средств");
	
	ЭтоВалютнаяПроводка = (ЭтотОбъект.Валюта <> ЭтотОбъект.Организация.ВалютаУчета);
	
	// дебет
	Если ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная Тогда
		
		Проводка.СчетДт = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления,
			ЭтотОбъект.Валюта,
			ЭтотОбъект.Брокер);
			
		Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета)  <> Неопределено Тогда 
			Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
		КонецЕсли;
		
		Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено Тогда
			Проводка.СубконтоДт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
		КонецЕсли;

		Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено Тогда
			Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
		КонецЕсли;
		
		Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда
			//как в ЕПС
			Если ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление Тогда
				ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ВводДенежныхСредств;
			ИначеЕсли ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратИзлишнеУдержаннойКомиссии Тогда
				ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПоступлениеДенежныхСредствОтУК;
			ИначеЕсли ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОшибочноЗачисленные Тогда
				ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ОшибочноЗачисленныеСписанныеДенежныеСредства;	
			ИначеЕсли ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами Тогда 
				ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПриходПроцентовСМО;	
			Иначе
				ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ВводДенежныхСредствВДУ;
			КонецЕсли;
			
			Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = ВидДвиженияДенежныхСредств;
		КонецЕсли;	
		
	ИначеЕсли ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Наличная Тогда
		
		Проводка.СчетДт = ?(ЭтоВалютнаяПроводка, ПланыСчетов.Основной.КассаОрганизацииВал, ПланыСчетов.Основной.КассаОрганизации);
		
	КонецЕсли;
	
	Если ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПФР
		и ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР Тогда
		СчетРасчетовСАгентом = БухгалтерскийУчет.ОпределитьНастройкуУчета(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		"СчетРасчетовСАгентом");
		
		Если НЕ ЗначениеЗаполнено(СчетРасчетовСАгентом) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить счет учета расчетов с агентом ",,,,Отказ);
		КонецЕсли; 	
		// кредит
		Проводка.СчетКт = СчетРасчетовСАгентом;
		Если СчетРасчетовСАгентом.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено Тогда
			Проводка.СубконтоКт.Контрагенты = РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(СчетДоверительногоУправления, ЭтотОбъект.Дата); 
		КонецЕсли; 
		// вал. суммы
		Если ЭтоВалютнаяПроводка Тогда
			Проводка.ВалютаДт = ЭтотОбъект.Валюта;
			Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		КонецЕсли;
		
		Если Проводка.СчетКт.Валютный И ЭтоВалютнаяПроводка Тогда
			Проводка.ВалютаКт = ЭтотОбъект.Валюта;
			Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
		КонецЕсли;	

		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СуммаВВалютеУчета, "Ввод денежных средств");
		// кредит
		Проводка.СчетДт = СчетРасчетовСАгентом;
		Если СчетРасчетовСАгентом.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено Тогда
			Проводка.СубконтоДт.Контрагенты = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления,ЭтотОбъект.Дата);	
		КонецЕсли; 
	КонецЕсли;
		
	// кредит
	Проводка.СчетКт = ЭтотОбъект.КоррСчет;
	
	Для НомСубк = 1 По Проводка.СчетКт.ВидыСубконто.Количество() Цикл
		Проводка.СубконтоКт[ЭтотОбъект.КоррСчет.ВидыСубконто[НомСубк - 1].ВидСубконто] = ЭтотОбъект["Субконто" + НомСубк];
	КонецЦикла;
	
	// вал. суммы
	Если ЭтоВалютнаяПроводка Тогда
		Проводка.ВалютаДт = ЭтотОбъект.Валюта;
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
	КонецЕсли;
	
	Если Проводка.СчетКт.Валютный И ЭтоВалютнаяПроводка Тогда
		Проводка.ВалютаКт = ЭтотОбъект.Валюта;
		Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
	КонецЕсли;	
	
КонецПроцедуры // ПроведениеПоРегиструБухгалтерии

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда 
		
		Если ДанныеЗаполнения.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская Тогда			
			ЭтотОбъект.Основание = ДанныеЗаполнения;
			Возврат;	
		КонецЕсли;
		
		Запрос = Новый Запрос;
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Организация КАК Организация,
			|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	Поручение.Ссылка КАК Основание,
			|	ЗНАЧЕНИЕ(Перечисление.ФормыДенежныхСредств.Безналичная) КАК ФормаДенежныхСредств,
			|	Поручение.РасчетныйСчетПолучатель КАК РасчетныйСчет,
			|	Поручение.РасчетныйСчет КАК РасчетныйСчетКонтрагента,
			|	Поручение.Контрагент КАК Контрагент,
			|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.СуммаОстаток КАК Сумма,
			|	ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Валюта КАК Валюта,
			|	Поручение.ВидОперации КАК ВидОперации,
			|	Поручение.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
			|	Поручение.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
			|	Поручение.КонтрагентДоговорТекстом КАК КонтрагентДоговорТекстом
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям.Остатки(
			|			,
			|			Основание = &Поручение
			|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)) КАК ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеНаДвижениеДенежныхСредств КАК Поручение
			|		ПО ЗадолженностиПоДенежнымСредствамПоПоручениямОстатки.Основание = Поручение.Ссылка";
			
		Запрос.УстановитьПараметр("Поручение", ДанныеЗаполнения);	
			
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			ЭтотОбъект.Основание = ДанныеЗаполнения;	
		Иначе
		
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "Основание, СтрокаБанковскойВыписки");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваДоходПоПаямЗПИФ Тогда
 		ПроверяемыеРеквизиты.Добавить("Пай");
	КонецЕсли;
	
	Если ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПайщика
		Или РаботаСДокументамиКлиентСервер.ТребуетсяПроверкаЗаполненияЗначенияКонтрагента(ЭтотОбъект) Тогда
		
		ПроверяемыеРеквизиты.Добавить("Контрагент");
		
	КонецЕсли;
		
	Если РаботаСДокументамиКлиентСервер.РеквизитОбязателенДляЗаполнения(ЭтотОбъект, "Основание") Тогда
		ПроверяемыеРеквизиты.Добавить("Основание");	
	КонецЕсли;
	
	Если ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Наличная Тогда
		ПроверяемыеРеквизиты.Добавить("Касса");
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
			
КонецПроцедуры

Функция БылТакойКлиент(СчетДоверительногоУправления, Контрагент)
	// эта хрень была сделана для проведения бух/нал/бэк/епс учета задним числом при условии изменения владельца счета ду
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправления.Клиент КАК Клиент
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|ГДЕ
		|	КлиентыДоверительногоУправления.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И КлиентыДоверительногоУправления.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Контрагент);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		РаботаСБанковскимиВыпискамиКлиентСервер.ПроверитьСоответствиеСтрокиБанковскойВыпискиИПлатежногоДокумента(ЭтотОбъект,
			ЭтотОбъект.СтрокаБанковскойВыписки, Перечисления.ВидыДвижений.Приход, Отказ);
			
		РаботаСДокументами.ПроверитьРеквизитыВводаВыводаДенежныхСредств(ЭтотОбъект, Отказ);
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Брокер)
			И Не ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Брокер может быть заполнен только для вида операции '" + Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами + "'", ЭтотОбъект, "ВидОперации",, Отказ);
		КонецЕсли;
		
		Если      ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная Тогда
			Если ЗначениеЗаполнено(ЭтотОбъект.Касса) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При выбранной безналичной форме денежных средств касса не должна быть заполнена", ЭтотОбъект, "ФормаДенежныхСредств",, Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчет) Тогда
				Если ЭтотОбъект.РасчетныйСчет.ЮрФизЛицо <> ЭтотОбъект.Организация.ЮрФизЛицо Тогда
			    	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет не принадлежит выбранной организации", ЭтотОбъект, "РасчетныйСчет",, Отказ);
				КонецЕсли;
				
				Если ЭтотОбъект.РасчетныйСчет.Валюта <> ЭтотОбъект.Валюта Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта расчетного счета отличается от валюты документа", ЭтотОбъект, "РасчетныйСчет",, Отказ);
				КонецЕсли;
			КонецЕсли;
			
			РаботаСДокументами.ПроверитьЗаполнениеРасчетногоСчета(
				Новый Структура("Дата, Организация, Брокер, РасчетныйСчет, ВалютаОплаты",
					ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.Брокер, ЭтотОбъект.РасчетныйСчет, ЭтотОбъект.Валюта),
				Отказ);
			
			Если ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчетКонтрагента) Тогда
				// хардкод для НГ
				
				Если ЭтотОбъект.РасчетныйСчетКонтрагента.ЮрФизЛицо <> ЭтотОбъект.Контрагент
					И ЭтотОбъект.РасчетныйСчетКонтрагента.ЮрФизЛицо <> ЭтотОбъект.РасчетныйСчетКонтрагента.Банк.ЮрФизЛицо
					И НЕ БылТакойКлиент(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Контрагент) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет контрагента не принадлежит выбранному контрагенту или банку", ЭтотОбъект, "РасчетныйСчетКонтрагента",, Отказ);
				КонецЕсли;
				
				Если ЭтотОбъект.РасчетныйСчетКонтрагента.Валюта <> ЭтотОбъект.Валюта Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта расчетного счета контрагента отличается от валюты документа", ЭтотОбъект, "РасчетныйСчетКонтрагента",, Отказ);
				КонецЕсли;
			КонецЕсли; 
						
		ИначеЕсли ЭтотОбъект.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Наличная Тогда
			Если ЭтотОбъект.Касса.ВалютаДенежныхСредств <> ЭтотОбъект.Валюта Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта кассы отличается от валюты документа", ЭтотОбъект, "Касса",, Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчет) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При выбранной наличной форме денежных средств расчетный счет не должен быть заполнен", ЭтотОбъект, "ФормаДенежныхСредств",, Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчетКонтрагента) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При выбранной наличной форме денежных средств расчетный счет контрагента не должен быть заполнен", ЭтотОбъект, "ФормаДенежныхСредств",, Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.Брокер) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При выбранной наличной форме денежных средств брокер не должен быть заполнен", ЭтотОбъект, "ФормаДенежныхСредств",, Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.СтрокаБанковскойВыписки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При выбранной наличной форме денежных средств строка банковской выписки не должен быть заполнена", ЭтотОбъект, "ФормаДенежныхСредств",, Отказ);
			КонецЕсли;			
			
		КонецЕсли;		
		
		Если ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПайщика Тогда
			Если ТипЗнч(Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Дата)) <> Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При виде операции '" + ЭтотОбъект.ВидОперации + "' можно выбирать только счета д/у ПИФ-ов", ЭтотОбъект, "СчетДоверительногоУправления",, Отказ);
			КонецЕсли; 
		КонецЕсли;
		
		Если ЭтотОбъект.Дата >= Дата(2021,1,23) Тогда
			Если ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратИзлишнеУдержанногоВознаграждения
				ИЛИ ЭтотОбъект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратИзлишнеУдержаннойКомиссии Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Проведение операции по виду %1 производится документами Начисление задолженности и Оплата", ЭтотОбъект.ВидОперации), ЭтотОбъект.Ссылка,, "Объект.ВидОперации", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтотОбъект.КоррСчет = ПланыСчетов.Основной.ЦелевоеФинансированиеПФРПереданноеВОтчетномГоду Тогда
			Если ЭтоНовый() Тогда 
				СсылкаНового = Документы.ВводДенежныхСредств.ПолучитьСсылку(Новый УникальныйИдентификатор());
				УстановитьСсылкуНового(СсылкаНового);
				ЭтотОбъект.Субконто1 = СсылкаНового;
			Иначе
				ЭтотОбъект.Субконто1 = ЭтотОбъект.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтотОбъект.Дата >= Дата(2021, 01, 01) И ЗначениеЗаполнено(ЭтотОбъект.КоррСчет) Тогда
		
			ДанныеСчета = БухгалтерскийУчет.ПолучитьСвойстваСчета(ЭтотОбъект.КоррСчет);
			
			Для Индекс = 1 По ДанныеСчета.КоличествоСубконто Цикл
				Если НЕ РаботаСМетаданнымиПовтИсп.НеПроверятьЗаполнениеСубконто(ЭтотОбъект.Организация, ЭтотОбъект.КоррСчет, ДанныеСчета["ВидСубконто" + Индекс])
					И НЕ ЗначениеЗаполнено(ЭтотОбъект["Субконто" + Индекс]) Тогда
				
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните субконто " + ДанныеСчета["ВидСубконто" + Индекс], ЭтотОбъект, "Субконто" + Индекс,, Отказ);
				
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.КоррСчетЕПС) Тогда
		
			ДанныеСчета = БухгалтерскийУчет.ПолучитьСвойстваСчета(ЭтотОбъект.КоррСчетЕПС);
			
			Для Индекс = 1 По ДанныеСчета.КоличествоСубконто Цикл
				Если НЕ РаботаСМетаданнымиПовтИсп.НеПроверятьЗаполнениеСубконто(ЭтотОбъект.Организация, ЭтотОбъект.КоррСчетЕПС, ДанныеСчета["ВидСубконто" + Индекс])
					И НЕ ЗначениеЗаполнено(ЭтотОбъект["СубконтоЕПС" + Индекс]) Тогда
				
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните субконто " + ДанныеСчета["ВидСубконто" + Индекс], ЭтотОбъект, "СубконтоЕПС" + Индекс,, Отказ);
				
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Основание) И ТипЗнч(ЭтотОбъект.Основание) = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда
			
			РаботаСДокументами.ПроверитьДатуИсполненияПоручения(ЭтотОбъект, Отказ);
			
			Если ЭтотОбъект.Основание.ВыводВсехАктивов Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать ""Ввод денежных средств"" на основании поручения с установленным флагом ""Вывод всех активов""",,, "Объект.Основание", Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;  	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли;
	 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
			
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
				
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
